## working text data

## .strip() .lstrip() .rstrip() methods

In [6]:
import pandas as pd
chicago = pd.read_csv('./data/chicago.csv').dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago.head()

,Name,Position Title,Department,Employee Annual Salary
0,"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
1,"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
2,"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
3,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
4,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [7]:
print("    Hello world   ".strip())
print("    Hello world   ".lstrip())
print("    Hello world   ".rstrip())

Hello world
Hello world
    Hello world

In [11]:
for col in chicago.columns:
    chicago[col] = chicago[col].str.strip()

## string methods on index and columns

In [12]:
chicago = pd.read_csv('./data/chicago.csv', index_col="Name").dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago.head()

,Position Title,Department,Employee Annual Salary
Name,,,
"AARON, ELVIA J",WATER RATE TAKER,WATER MGMNT,$90744.00
"AARON, JEFFERY M",POLICE OFFICER,POLICE,$84450.00
"AARON, KARINA",POLICE OFFICER,POLICE,$84450.00
"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

In [17]:
chicago.index = chicago.index.str.strip().str.title()
chicago.columns = chicago.columns.str.strip().str.upper()
chicago.head()

,POSITION TITLE,DEPARTMENT,EMPLOYEE ANNUAL SALARY
Name,,,
"Aaron, Elvia J",WATER RATE TAKER,WATER MGMNT,$90744.00
"Aaron, Jeffery M",POLICE OFFICER,POLICE,$84450.00
"Aaron, Karina",POLICE OFFICER,POLICE,$84450.00
"Aaron, Kimberlei R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,$89880.00
"Abad Jr, Vicente M",CIVIL ENGINEER IV,WATER MGMNT,$106836.00

## .split() method

In [18]:
"Hello my name is Piotr".split(" ")

['Hello', 'my', 'name', 'is', 'Piotr']

In [45]:
chicago = pd.read_csv('./data/chicago.csv', index_col="Name").dropna(how='all')
chicago['Department'] = chicago['Department'].astype('category') 
chicago['Position Title'] = chicago['Position Title'].astype('category') 
chicago = chicago.reset_index()

In [52]:
firstNames = chicago['Name'].str.split(',').str.get(0)
lastNames = chicago['Name'].str.split(',').str.get(1)
chicago['First Name'] = firstNames
chicago['Last Name'] = lastNames
chicago.head()
chicago['First Name'].str.title().value_counts()

Williams        293
Johnson         244
Smith           241
Brown           185
Jones           183
Rodriguez       171
Jackson         136
Garcia          130
Davis           127
Hernandez       110
Martinez        108
Lopez           106
Gonzalez        104
Perez           100
Wilson           94
Rivera           90
Thomas           89
Anderson         82
Torres           81
Murphy           80
Robinson         79
Moore            78
Sanchez          76
Harris           76
Miller           75
Lewis            74
Taylor           73
Martin           72
White            66
Clark            66
               ...
Kapustianyk       1
Tudisco Jr        1
Bielesch          1
Kadich            1
Gagliardotto      1
Tamimi            1
Goecke            1
Abramski          1
Gurkan            1
Lodwich           1
Ruzas             1
Neerose           1
Bowersox          1
Schenkel          1
Norwood Iii       1
Xue               1
Runas             1
Maglaras          1
Romero Jr         1
Hairston Jr       1
Antonik           1
Heitz             1
Fleckenstein      1
Henrichsen        1
Gandia            1
Dear              1
Uchwal            1
Keeran            1
Oprondek          1
Kinard            1
Name: First Name, Length: 13829, dtype: int64

In [58]:
chicago['Position Title'].str.split(" ").str.get(0).str.title().value_counts()

Police                   10856
Firefighter-Emt           1509
Sergeant                  1186
Pool                       918
Firefighter                810
Crossing                   775
Motor                      721
Sanitation                 715
Paramedic                  641
Asst                       606
Fire                       512
Traffic                    512
Senior                     470
Construction               452
Lieutenant-Emt             394
Administrative             375
Library                    365
Librarian                  335
Lieutenant                 332
Operating                  324
Electrical                 313
Aviation                   309
Firefighter/Paramedic      259
General                    257
Staff                      250
Clerk                      242
Foreman                    237
Hoisting                   214
Deputy                     213
Machinist                  210
                         ...
Equal                        1
Assoc                        1
Manager-Fleet                1
Hate                         1
Development                  1
Portfolio                    1
Criminalist                  1
Chairperson                  1
Mayor                        1
Subpoena                     1
Dentist                      1
Production                   1
Loan                         1
Employee                     1
Inspector                    1
Offset                       1
Analyst                      1
Structural                   1
Prepress                     1
Purchasing                   1
Comm                         1
Mobile                       1
Curator                      1
Asbestos                     1
Warranty                     1
Leasing                      1
Telecommunications           1
Supervisor                   1
Photographer                 1
Commander-Paramedic          1
Name: Position Title, Length: 320, dtype: int64